load-test.yml
config:
  target: "ws://localhost:443"
  phases:
    - duration: 60
      arrivalRate: 100  # New connections per second
scenarios:
  - engine: "ws"
    flow:
      - send: "Hello server"  # Message sent after connection
      - think: 1              # Wait time before next message
      - loop:
          - send: "Message from client"
          - think: 1